EventSamples/ALERT.UI.KEUIRequest/8734306604021627196183.xml

<?xml version="1.0" encoding="utf-8" ?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"><s:Header/><s:Body><wsnt:Notify><wsnt:NotificationMessage><wsnt:Topic/><wsnt:ProducerReference><wsa:Address>http://www.alert-project.eu/keui</wsa:Address></wsnt:ProducerReference><wsnt:Message><ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:schemaLocation="http://www.alert-project.eu/alert-root.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns1:head><ns1:sender>Alert-UI</ns1:sender><ns1:sequencenumber>1</ns1:sequencenumber><ns1:timestamp>1359970042812</ns1:timestamp></ns1:head><ns1:payload><ns1:meta><ns1:eventName>ALERT.UI.KEUIRequest</ns1:eventName><ns1:eventType>request</ns1:eventType><ns1:eventId>8734306604021627196183</ns1:eventId></ns1:meta><ns1:eventData><s1:keuiRequest><s1:requestType>Query</s1:requestType><s1:requestData><query type="generalQuery"><queryArgs><conditions><person uri="http://www.alert-project.eu/ontologies/alert_scm.owl#Person1575"/><postTypes>issues,commits,forums,mails,wikis</postTypes></conditions></queryArgs><params includePeopleData="True" maxCountItems="1000" resultData="peopleData" sortBy="relevance"/></query></s1:requestData></s1:keuiRequest></ns1:eventData></ns1:payload></ns1:event></wsnt:Message></wsnt:NotificationMessage></wsnt:Notify></s:Body></s:Envelope>